Repository: seanpm2001/mt-training-data
Catalog: tn/tn_pontoon.tmx
Source language: en_us
Languages: tn

source: Filtered sentences due to requirements failing (please submit fixed versions as new sentences):
tn: Mela e fokoditswe ka gonne ga go a fitlhelelwa ditekanyetso (tsweetswee romela dithanolo tse di siameng jaaka mela e mesha):

source: Finding existing sentences in the Public Domain
tn: Re batla dipolelo tse di gone mo Lefelong la Botlhe

source: Find others who care. That could be universities, language schools, advocacy groups or data science communities. Reach out and explain clearly how they can help and why. <outreachTemplates>See our template outreach emails</outreachTemplates>.
tn: Bona ba bangwe ba ba amegang. E ka nna diyunibesithi, dikolo tsa dipuo, ditlhopha tsa dikemedi kgotsa merafe ya tshedimosetso ya saense. Dira sengwe mme o tlhalose sentle gore ba ka thusa jang le gore ka ntlha yang. <outreachTemplates>Bona diimeile tsa rona tsa thempoleite ya go thusa</outreachTemplates>.

source: Finish editing first?
tn: Fetsa go baakanya pele?

source: Finish recording
tn: Fetsa kgatiso

source: Finish recording first?
tn: Fetsa go gatisa pele?

source: Finish Review
tn: Fetsa Tshekatsheko

source: Finnish
tn: Se-Finland

source: First, check if your language <languageLink>already exists</languageLink>. If it isn’t, you can <languageRequestLink>ask about adding your language</languageRequestLink>. There are two stages. Translating the site, and collecting sentences
tn: Sa ntlha, tlhola gore a puo ya gago <languageLink>e setse e le teng</languageLink>. Fa e seyo, o ka <languageRequestLink>botsa ka go tsenya puo ya gago</languageRequestLink>. Go na le magato a le mabedi. Go ranola webosaete le go kgobokanya dipolelo

source: Foreign letters. Letters must be valid in the language being spoken. For example, “ж” is a letter in the Russian alphabet but is never used in English and so should never appear in any English source text.
tn: Ditlhaka tsa seeng. Ditlhaka di tshwanetse go dumelelwa mo puong e e buiwang. Ka sekai, “ж” ke tlhaka e e dirisiwang mo puong ya se-Russia mme ga e dirisiwe mo Seesemaneng, ka jalo ga ya tshwanela go tlhagelela mo mokwalong ope wa Seesemane.

source: For every voice clip donated, and every audio clip validated, your account dashboards are updated to reflect your latest progress in each language you contribute to. Yes, you can contribute to more than one!<br/><br/> Use dashboards to track your stats, see how you're doing alongside others in the community, and set daily or weekly contribution goals.
tn: Mo kgatisong nngwe le nngwe ya lentswe e e abilweng, le kgatiso nngwe le nngwe e e tlhomamisiwang, desheboto ya akhaonto ya gago e a tlhabololwa go bontsha kgatelopele ya gago ya bosheng mo puong nngwe le nngwe e o abang mo go yone. Ee, o ka kgona go abela puo e feta e le nngwe!<br/><br/> Dirisa didesheboto go bona dipalopalo tsa gago, go bona gore o dira jang fa go bapisiwa le batho ba bangwe, mme o ipeele mekgele ya letsatsi le letsatsi kgotsa ya beke le beke ya go aba.

source: for example
tn: ka sekai

source: For public domain text not available online, you could use academic referencing style e.g Harvard style "Jess (2021) My Public licence poems"
tn: Fa o dirisa tshedimosetso ya batho botlhe mme e seyo mo inthaneteng, o ka dirisa mokgwa wa thutego wa go ntsha tshupiso, ka sekai, mokgwa wa Harvard "Jess (2021) My Public licence poems"

source: For these launched languages the website has been successfully <localizationGlossaryLink>localized</localizationGlossaryLink>, and has enough <sentenceCollectionGlossaryLink>sentences collected</sentenceCollectionGlossaryLink> to allow for ongoing <speakLink>Speak</speakLink> and <listenLink>Listen</listenLink> contributions.
tn: Mo dipuong tseno tse di simolotsweng, webosaete e <localizationGlossaryLink>ranotswe</localizationGlossaryLink> ka katlego, mme e na le <sentenceCollectionGlossaryLink>dipolelo tse di lekaneng tse di phuthilweng</sentenceCollectionGlossaryLink> gore re kgone go nna re tsenya tse di <speakLink>Buiwang</speakLink> le tse <listenLink>Reediwang</listenLink>.

source: French
tn: Sefora

source: Frequently Asked Questions
tn: Dipotso Tse Gantsi di Bodiwang

source: Frisian
tn: Se-Frisia

source: Fulah
tn: Se-Fulah

source: Galician
tn: Se-Galicia

source: Gender
tn: Bong

source: Georgian
tn: Se-Georgia

source: German
tn: Sejeremane

source: Get involved
tn: Nna le seabe

source: Get Involved
tn: Nna le Seabe

source: Get started with goals
tn: Simolola ka maikaelelo

source: Get Started with Speech Recognition
tn: Simolola ka Temogopuo

source: <githubLink>NVIDIA NeMo</githubLink>™ is an <docsLink>open-source toolkit</docsLink> for researchers developing state-of-the-art conversational AI models.
tn: <githubLink>NVIDIA NeMo</githubLink>™ ke <docsLink>sediriswa sa batho botlhe</docsLink> se babatlisisi ba se dirisang go tlhama mokgwa wa puisano wa mefuta ya AI.

source: Glossary
tn: Lenaane la Mafoko

source: Goal reached
tn: Boikaelelo bo fitlheletswe

source: Goals
tn: Maikaelelo

source: Goan Konkani
tn: Se-Goan Konkani

source: Go to Discourse
tn: Ya kwa Discourse

source: Go to Languages Page
tn: Ya Kwa Tsebeng ya Dipuo

source: Go to { $name }
tn: Ya go { $name }

source: <governanceLink>Read more about how we're governed</governanceLink>
tn: <governanceLink>Bala mo go oketsegileng ka ga go re re laolwa jang</governanceLink>

source: Government proceedings, books and articles are also great however since the text tends to be a little more formal they are less of a priority.
tn: Mananeo a puso, dibuka le ditlhogo le tsone di siame, mme e re ka gantsi mokwalo o na le go gagamala thata, ga di botlhokwa go le kalo.

source: Grammatical / spelling error
tn: Phoso ya thutapuo / mopeleto

source: Great! How many clips a week?
tn: Go gontle! Dikgatiso di le kae ka beke?

source: Great! How many clips per day?
tn: Go gontle! Dikgatiso di le kae ka letsatsi?

source: Great!<recordIcon></recordIcon> Record your next clip
tn: Go gontle!<recordIcon></recordIcon> Dira kgatiso e e latelang

source: Great work!<playIcon></playIcon> Listen again when you're ready
tn: O berekile!<playIcon></playIcon> Reetsa gape fa o ipaakantse

source: Greek
tn: Segerika

source: Guarani
tn: Se-Guarani

source: Haitian
tn: Se-Haiti

source: Hakha Chin
tn: Se-Hakha Chin

source: Hausa
tn: Se-Hausa

source: Have Feedback?
tn: A o Na le Pegelo?

source: Have you read our Terms?
tn: A o badile Melawana ya rona?

source: Having an account is not required to contribute, though it is helpful.
tn: Ga o tlhoke go nna le akhaonto gore o thuse, mme gone go mosola.

source: Having a profile is not required to contribute though it is helpful, see why below.
tn: Ga o tlhoke go nna le porofaele gore o thuse, mme gone go a thusa. Bona gore ka ntlha yang fa tlase.

source: Hebrew
tn: Sehebera

source: Help
tn: Thuso

source: Help Common Voice reach { $hours } hours in a language with a personal goal
tn: Thusa Common Voice go fitlhelela diura di le { $hours } mo puong ka maikaelelo a batho

source: Help create Common Voice’s first target segment in { $locale }
tn: Thusa go dira karolwana ya ntlha ya Common Voice ka { $locale }

source: Help reach { $hours } hours in { $language } with a personal goal
tn: Thusa go fitlhelela diura tse { $hours } mo { $language } ka maikaelelo a botho

source: Help teach machines how real people speak, donate your voice at { $link }
tn: Thusa go ruta metšhine gore batho ba mmatota ba bua jang, abelana ka lentswe la gago mo { $link }

source: Help us build a community around voice technology, stay in touch via email.
tn: Re thuse go aga setšhaba ka thekenoloji ya lentswe, nna o ikgolaganya ka imeile.

source: Help us build a high quality, publicly open dataset
tn: Re thuse go aga rekoto ya tshedimosetso ya phatlalatsa, ya maemo a a kwa godimo

source: Help us by reviewing sentences for correctness according to the guidelines.
tn: Re thuse go sekaseka mela gore a e nepagetse go ya ka dikaelo.

source: Help us by writing or collecting Public Domain sentences.
tn: Re thuse ka go kwala kgotsa go kgobokanya mela ya Lefelo la Botlhe.

source: Help us find more voices, share your goal
tn: Re thuse go bona mantswe a a oketsegileng, abelana ka maikaelelo a gago

source: Help us find others to donate their voice!
tn: Re thuse go bona ba bangwe gore ba re fe mantswe a bone!

source: Help us get to { $goal }
tn: Re thuse go { $goal }

source: Help us validate sentences!
tn: Re thuse go tlhomamisa mela!

source: Help us validate voices
tn: Re thuse go tlhomamisa mantswe

source: Here are some tips to find sentences:
tn: Tseno ke dikakantsho dingwe tsa go bona mela:

source: Here are the links to download your ZIP files.
tn: Tseno ke dilinki tsa go itseela difaele tsa gago tsa ZIP.

source: Hidden
tn: E fitlhegile

source: Hill Mari
tn: Se-Hill Mari

source: Hindi
tn: Se-Hindi

source: His hand was rais-ed.
tn: Seatla sa gagwe se ne se tsholedi-tswe.

source: Home
tn: Tsebe ya Tshimologo

source: Hours
tn: Diura

source: Hours Recorded
tn: Diura tse di Gatisitsweng

source: Hours Validated
tn: Diura tse di Tlhomamisitsweng

source: { $hours } validated hours so far!
tn: Go tlhomamisitswe diura di le { $hours } go tla go fitlha ga jaana!

source: How ?
tn: Jang?

source: How are project decisions made?
tn: Ditshwetso ka diporojeke di dirwa jang?

source: How can I get the Common Voice data?
tn: Nka bona jang tshedimosetso ya Common Voice?

source: How can we effectively grow a language on Common Voice?
tn: Re ka godisa puo jang ka katlego mo Common Voice?

source: How does Common Voice calculate hours?
tn: Common Voice e bala diura jang?

source: How does Common Voice work?
tn: Common Voice e dira jang?

source: How does site localization work?
tn: Go ranolela webosaete go dira jang?

source: How do I access and use the dataset?
tn: Ke fitlhelela jang le go dirisa rekoto ya tshedimosetso?

source: How do I add a language?
tn: Ke tsenya puo jang?

source: How do I add sentences?
tn: Ke tsenya mela jang?

source: How do I know whether to approve a voice clip?
tn: Ke tla itse jang gore a ke tshwanetse go amogela kgatiso ya lentswe?

source: How do I record a high quality voice clip?
tn: Ke rekota jang kgatiso ya lentswe ya maemo a a kwa godimo?

source: How do I stay in touch?
tn: Ke ikgolaganya jang le lona?

source: How do you ensure anonymity and privacy of the people who donated their voices?
tn: Lo tlhomamisa jang gore go nna tshedimosetso le diphiri tsa batho ba ba abelanang mantswe ga di phasaladiwe?

source: How to
tn: Kafa

source: How-to
tn: Nka dira jang

source: How to Cite
tn: Tsela ya go Nopola

source: How would you describe your accent?
tn: O ka tlhalosa jang puo ya gago?

source: Hungarian
tn: Se-Hungary

source: I agree
tn: Ke a dumela

source: I am a non-native speaker and I speak with an accent, do you still want my voice?
tn: Ga se puo ya gaetsho e bile ga ke e bue jaaka beng ba yone, a lo santse lo batla lentswe la me?

source: Icelandic
tn: Se-Iceland

source: I confirm that these sentences are <wikipediaLink>public domain</wikipediaLink> and I have permission to upload them.
tn: Ke tlhomamisa gore mela eno ke ya <wikipediaLink>batho botlhe</wikipediaLink> e bile ke na le tetla ya go e tsenya.

source: I'd like to receive emails such as goal reminders, my progress updates and newsletters about Common Voice.
tn: Nka rata go amogela diimeile tse di jaaka dikgopotso tsa maikaelelo, ditlhabololo tsa kgatelopele ya me le makwalodikgang a Common Voice.

source: I do not agree
tn: Ga ke dumele

source: If a clip is rejected by 2 people, it is released in a different subset of the dataset.
tn: Fa kgatiso e gannwe ke batho ba le 2, e tsenngwa mo karolong e nngwe ya rekoto ya tshedimosetso.

source: If the recording breaks up, or has crackles, reject unless the entirety of the text can still be heard.
tn: Fa kgatiso e kgaoga kgotsa e gagasha, e gane, ntle le fa mafoko otlhe a kgona go utlwiwa.

source: If the sentence does not meet the above criteria, click the &quot;Reject&quot; button on the left. If you are unsure about the sentence, you may also skip it and move on to the next one.
tn: Fa polelo e sa fitlhelele ditshwanelego tse di fa godimo, tobetsa konopo ya &quot;Gana&quot; kafa molemeng. Fa o sa tlhomamisege ka polelo, o ka e tlola mme wa ya kwa go e e latelang.

source: If the sentence does not meet the above criteria, click the "Reject" button. If you are unsure about the sentence, you may also skip it and move on to the next one.
tn: Fa polelo e sa fitlhelele ditshwanelego tse di fa godimo, tobetsa konopo ya "Gana." Fa o a tlhomamisege ka polelo , o ka e tlola mme wa fetela mo go e e latelang.

source: If the sentence meets the criteria, click the "Approve" button.
tn: Fa mola o tsamaisana le dintlha tsa tshwanelego, tobetsa konopo ya "Amogela."

source: If the sentence meets the criteria, click the &quot;Approve&quot; button on the right.
tn: Fa mola o dumalana le dintlha tsa go tshwanelega, tobetsa konopo ya &quot;E Siame&quot; e e ka fa mojeng.

source: If you come across something that these guidelines don’t cover, please vote according to your best judgement. If you really can’t decide, use the skip button and go on to the next recording.
tn: Fa o kopana le sengwe se dikaelo tseno di sa bueng ka sone, tsweetswee tlhopha go ya ka tsela e e molemolemo e o e akanyang. Fa tota o sa kgone go dira tshwetso, dirisa konopo ya go tlola mme o ye kwa kgatisong e e latelang.

source: If you could <strong>hear them</strong> and <strong>understand them</strong>, it’s usually <strong>best to approve</strong>.
tn: Fa o ne o ka kgona go <strong>ba utlwa</strong> le go <strong>ba tlhaloganya</strong>, gantsi go <strong>siame go di amogela</strong>.

source: If you don’t hear from us within a couple of days, reach out at <emailLink>{ $email }</emailLink> and we’ll get back to you!
tn: Fa o bona go feta malatsinyana re sa bue sepe, ikgolaganye le rona mo <emailLink>{ $email }</emailLink> mme re tla boela kwa go wena!

source: If you’re looking for tools to build ASR models, you can connect to other people in the community <discourseLink>on Discourse</discourseLink>.
tn: Fa e le gore o batla didirisiwa tsa go aga mefuta ya ASR, o ka ikgolaganya le batho ba bangwe mo karolong eno <discourseLink>mo Discourse</discourseLink>.

source: If your language is not listed here, you can request it through <languageProcessLink>this process</languageProcessLink>.
tn: Fa puo ya gago e sa tlhage fano, o ka e kopa ka <languageProcessLink>tsela eno</languageProcessLink>.

source: If you run out of sentences to review, please help us collect more sentences!
tn: Fa o felelwa ke mela e e sekasekiwang, tsweetswee re thuse go kgobokanya mela e e oketsegileng!

source: If you think the pronunciation makes it <strong>impossible to understand</strong>, or there’s a <strong>lot of background noise</strong>, or there are <strong>other people speaking too</strong>, then you should reject the clip. <accuracyLink>See more information in our accuracy criteria</accuracyLink>.
tn: Fa o akanya gore tsela e le bidiwang ka yone e dira gore <strong>go se ka ga kgonega go tlhaloganya</strong>, kgotsa go na le <strong>modumo o montsi kwa morago</strong>, kgotsa go na le <strong>batho ba bangwe ba le bone ba buang</strong>, o tshwanetse go gana kgatiso eo. <accuracyLink>Bona tshedimosetso e e oketsegileng mo ditshwanelegong tsa rona tsa go nepa</accuracyLink>.

source: Igbo
tn: Se-Igbo

source: I just created a personal goal for voice donation to #CommonVoice -- join me and help teach machines how real people speak { $link }
tn: Ke fetsa go dira maikaelelo a botho a go abelana ka lentswe go #CommonVoice -- dira le nna mme o nthuse go ruta metšhine gore batho ba mmatota ba bua jang { $link }

source: I'm okay with you handling this info as you explain in Mozilla's <privacyLink>Privacy Policy</privacyLink>
tn: Ga ke na bothata le gore lo dirise tshedimosetso eno jaaka lo tlhalosa mo <privacyLink>Pholisi ya Polokodiphiri</privacyLink> ya Mozilla

source: Includes email, username & demographic info, available right away
tn: E akaretsa imeile, leinatiriso le tshedimosetso ya dipalopalo, e e gone ka yone nako eo

source: Includes mp3s and related sentences, may take some time to prepare
tn: E akaretsa di-mp3 le mela e e tsamaisanang le yone, go ka tsaya nakonyana gore di rulaganngwe

source: Indonesian
tn: Se-Indonesia

source: Information about the language
tn: Tshedimosetso ka puo

source: In Progress
tn: E a Tswelela

source: Interested in learning more and contributing to the project?
tn: A o kgatlhegela go itse mo go oketsegileng le go nna le seabe mo porojekeng?

source: Interface Language
tn: Puo ya go Ikgokaganya

source: Interlingua
tn: Dipuo tse di Kopaneng

source: Interlingue
tn: Dipuo tse di kopaneng

source: Irish
tn: Se-Ireland

source: IsiNdebele (North)
tn: Sendebele (Bokone)

source: IsiNdebele (South)
tn: Sendebele (Borwa)

source: Is my account information public?
tn: A tshedimosetso ya akhaonte ya me e bonwa ke batho botlhe?

source: <isoCodeLink>ISO Codes</isoCodeLink> if known
tn: <isoCodeLink>Dikhouto tsa ISO</isoCodeLink> fa di itsiwe

source: Is the clip valid?
tn: A kgatiso e siame?

source: Is the goal of Common Voice to build a voice assistant?
tn: A maikaelelo a Common Voice ke go tlhama mothusi wa lentswe?

source: Italian
tn: Sentadiana

source: It contains words or phrases that are hard to read or pronounce.
tn: E na le mafoko kgotsa dipolelo tse go leng thata go di bala kgotsa go di bitsa.

source: It is written in a language different than what I’m speaking.
tn: E kwadilwe ka puo e e farologaneng le e ke e buang.

source: It's important that you reference where you found the public licence to avoid plagiarism and to allow for follow ups on <copyrightIssuesLink>copyright issues</copyrightIssuesLink>. Here are a few ways you can cite the work.
tn: Go botlhokwa go kwala gore o bone kae dilaesense tsa batho botlhe go tila go utswa tshedimosetso le go letla ditatediso mo <copyrightIssuesLink>mathata a tetlokhopi</copyrightIssuesLink>. Fano ke ditsela di le mmalwa tse o ka umakang tiro eno ka tsone.

source: Izhorian
tn: Se-Izhoria

source: Japanese
tn: Sejapane

source: Join the Common Voice mailing list
tn: Nna karolo ya lenaane la thomelo ya melaetsa la Common Voice

source: Just Unsure?
tn: Ga o A Tlhomamisega?

source: Kabardian
tn: Se-Kabardia

source: Kabyle
tn: Se-Kabyle

source: Kaqchikel
tn: Se-Kaqchikel

source: Karakalpak
tn: Se-Karakalpak

source: Kazakh
tn: Se-Kazakh

source: { $kb }kb max
tn: { $kb }kb bogolo

source: Keep
tn: Boloka

source: Keep it up, record again <recordIcon></recordIcon>
tn: Tshwara fela jalo, gatisa gape <recordIcon></recordIcon>

source: Keep the recordings
tn: Boloka dikgatiso

source: Keep track of your progress and metrics across multiple languages.
tn: Nna o etse tlhoko kgatelopele ya gago le gore o dira jang mo dipuong tse di farologaneng.

source: Keep track of your progress with a profile
tn: Boloka kgatelopele ya gago ka porofaele

source: Keep track of your progress with a profile and help our voice data be more accurate.
tn: Ela tlhoko kgatelopele ya gago o dirisa porofaele mme o thuse tshedimosetso ya rona ya mantswe gore e nepagale thata.

source: Khmer
tn: Se-Khmer

source: K'iche'
tn: Se-K'iche'

source: Kikuyu
tn: Se-Kikuyu

source: Kinyarwanda
tn: Se-Kinyarwanda

source: Komi-Zyrian
tn: Se-Komi-Zyria

source: Konkani (Devanagari)
tn: Se-Konkani (Devanagari)

source: Korean
tn: Se-Korea

source: Kurmanji Kurdish
tn: Se-Kurmanji Kurdish

source: Kyrgyz
tn: Se-Kyrgyz

source: Language
tn: Puo

source: Language Request
tn: Kopo ya Puo

source: Language request successfully submitted, thank you.
tn: Kopo ya puo e kgonne go romelwa ka katlego, malebo.

source: Languages
tn: Dipuo

source: Languages can have their <validationRulesLink>own validation rules</validationRulesLink> with additional requirements. If there is no specific validation file for a language, we are using the generic English rules.
tn: Dipuo di ka nna le <validationRulesLink>melao ya tsone ya go tlhomamisa</validationRulesLink> mmogo le dipatlafalo tse dingwe. Fa go se na faele e e rileng ya go tlhomamisa puo eo, re dirisa melao e e tlwaelegileng ya Seesemane.

source: Latvian
tn: Se-Latvia

source: Launched
tn: E thankgolotswe

source: Leaderboard Visibility
tn: Ponalo Ya ba Ba di Gogang Kwa Pele

source: Learn how to take part
tn: Ithute go tsaya karolo

source: Learn More
tn: Ithute mo go Oketsegileng

source: Leaving now means you’ll lose your changes
tn: Fa o tswa gone jaanong o tla latlhegelwa ke diphetogo tse o di dirileng

source: Leaving now means you'll lose your progress
tn: Fa o tswa gone jaanong o tla latlhegelwa ke kgatelopele e o e dirileng

source: Let's Get Started
tn: A re Simolole

source: LibriSpeech is a corpus of approximately 1000 hours of 16Khz read English speech derived from read audiobooks from the LibriVox project.
tn: LibriSpeech ke direkoto tsa diura di ka nna 1000 tsa 16Khz tse di balang mela ya Seesemane tse di tsewang mo dibukeng tsa mantswe tsa porojeke ya LibriVox.

source: License
tn: Laesense

source: License: <licenseLink>CC-0</licenseLink>
tn: Laesense: <licenseLink>CC-0</licenseLink>

source: License: <licenseLink>{ $license }</licenseLink>
tn: Laesense: <licenseLink>{ $license }</licenseLink>

source: Ligurian
tn: Se-Liguria

source: Link Copied
tn: Linki e Kopolotswe

source: Links to websites that can help us understand the language
tn: Dilinki tsa diwebosaete tse di ka re thusang go tlhaloganya puo

source: Listen
tn: Reetsa

source: Listening
tn: O reeditse

source: Listen-Queue
tn: Mola wa theetso

source: Lithuanian
tn: Se-Lithuania

source: Loading…
tn: E a Tsenya...

source: Loading rejected sentences…
tn: E tsenya dipolelo tse di gannweng...

source: Loading sentences…
tn: E tsenya mela...

source: Loading your sentences…
tn: E tsenya mela ya gago...

source: Localization
tn: Thanolo

source: Localized
tn: E ranoletswe

source: Login failed
tn: Ga o a kgona go tsena

source: Login Identity
tn: Boitshupo Jwa go Tsena

source: Log in or sign up to get started
tn: Tsena kgotsa ikwadise go simolola

source: Login / Signup
tn: Tsena / Ikwadise

source: Log In / Sign Up
tn: Tsena / Ikwadise

source: Log In / Sign Up with { $company } email
tn: Tsena / Ikwadise ka imeile ya { $company }

source: Logout
tn: Tswa

source: Log Out
tn: Tswa

source: Looks like there aren't any clips to listen to in this language. Help us fill the queue by recording some now.
tn: Go lebega go se na dikgatiso dipe tse di tlhokang go reediwa mo puong eno. Re thuse go di oketsa ka go rekota dingwe gone jaanong.

source: Luganda
tn: Se-Luganda

source: Luxembourgish
tn: Se-Luxembourg

source: Macedonian
tn: Se-Macedonia

source: Maithili
tn: Se-Maithili

source: Make sure the platform is recording before you start speaking, and that it only stops once you’re finished.
tn: Tlhomamisa gore polatefomo e a rekota pele o simolola go bua, le gore o emisa go rekota fa o setse o feditse.

source: Make sure the sentence meets the following criteria:
tn: Tlhomamisa gore mela e tsamaisana le dintlha tse di latelang:

source: Make your submitted data as rich as possible by providing some anonymous demographic data. We de-identify all demographic data before making it public.
tn: Dira gore tshedimosetso e o e romelang e nne ntsi kafa go kgonegang ka gone ka go re bolelela bong le dingwaga tsa gago kwa ntle ga go kaya gore o mang. Re dira gore go se nne le tshedimosetso epe e e senolang gore o mang pele re e phasalatsa.

source: Malagasy
tn: Se-Malagasy

source: Malay
tn: Se-Malay

source: Malayalam
tn: Se-Malayalam

source: Male
tn: Banna

source: Maltese
tn: Se-Malta

source: Manage Email Subscriptions
tn: Laola Dipeeletso tsa Imeile

source: Manage Subscriptions
tn: Laola Dipeeletso

source: Mapudungun
tn: Se-Mapudungun

source: Marathi
tn: Se-Marathi
